using D2Tools.Types;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Runtime.InteropServices;
using System.Text;
using GameOverlay.Drawing;

namespace D2Tools.Structs
{
    public enum D2Stat : short
    {
        STAT_INVALID = -1,
        STAT_STRENGTH = 0,                  // 000
        STAT_ENERGY,                        // 001
        STAT_DEXTERITY,                     // 002
        STAT_VITALITY,                      // 003
        STAT_STATPTS,                       // 004
        STAT_SKILLPTS,                      // 005
        STAT_HITPOINTS,                     // 006
        STAT_MAXHP,                         // 007
        STAT_MANA,                          // 008
        STAT_MAXMANA,                       // 009
        STAT_STAMINA,                       // 00A
        STAT_MAXSTAMINA,                    // 00B
        STAT_LEVEL,                         // 00C
        STAT_EXPERIENCE,                    // 00D
        STAT_GOLD,                          // 00E
        STAT_GOLDBANK,                      // 00F
        STAT_ITEM_ARMOR_PERCENT,            // 010
        STAT_ITEM_MAXDAMAGE_PERCENT,        // 011
        STAT_ITEM_MINDAMAGE_PERCENT,        // 012
        STAT_TOHIT,
        STAT_TOBLOCK,
        STAT_MINDAMAGE,
        STAT_MAXDAMAGE,
        STAT_SECONDARY_MINDAMAGE,
        STAT_SECONDARY_MAXDAMAGE,
        STAT_DAMAGEPERCENT,
        STAT_MANARECOVERY,
        STAT_MANARECOVERYBONUS,

        STAT_ITEM_DAMAGE_PERCENT_VS_MONSTER,
        STAT_ITEM_TOHIT_VS_MONSTER,
        STAT_ITEM_TOHIT_PERCENT_VS_MONSTER,
        STAT_ITEM_AC_VS_MONSTER,
        STAT_ITEM_AC_PERCENT_VS_MONSTER,
        STAT_FIRELENGTH,
        STAT_BURNINGMIN,
        STAT_BURNINGMAX,
        STAT_PROGRESSIVE_DAMAGE,
        STAT_PROGRESSIVE_STEAL,
        STAT_PROGRESSIVE_OTHER,
        STAT_PROGRESSIVE_FIRE,
        STAT_PROGRESSIVE_COLD,
        STAT_PROGRESSIVE_LIGHTNING,
        STAT_ITEM_EXTRA_CHARGES,
        STAT_PROGRESSIVE_TOHIT,
        STAT_POISON_COUNT,
        STAT_DAMAGE_FRAMERATE,
        STAT_PIERCE_IDX,
        STAT_PASSIVE_FIRE_MASTERY,
        STAT_PASSIVE_LTNG_MASTERY,
        STAT_PASSIVE_COLD_MASTERY,
        STAT_PASSIVE_POIS_MASTERY,
        STAT_PASSIVE_FIRE_PIERCE,
        STAT_PASSIVE_LTNG_PIERCE,
        STAT_PASSIVE_COLD_PIERCE,
        STAT_PASSIVE_POIS_PIERCE,
        STAT_PASSIVE_CRITICAL_STRIKE,
        STAT_PASSIVE_DODGE,
        STAT_PASSIVE_AVOID,
        STAT_PASSIVE_EVADE,
        STAT_PASSIVE_WARMTH,
        STAT_PASSIVE_MASTERY_MELEE_TH,
        STAT_PASSIVE_MASTERY_MELEE_DMG,
        STAT_PASSIVE_MASTERY_MELEE_CRIT,
        STAT_PASSIVE_MASTERY_THROW_TH,
        STAT_PASSIVE_MASTERY_THROW_DMG,
        STAT_PASSIVE_MASTERY_THROW_CRIT,
        STAT_PASSIVE_WEAPONBLOCK,
        STAT_PASSIVE_SUMMON_RESIST,
        STAT_MODIFIERLIST_SKILL,
        STAT_MODIFIERLIST_LEVEL,
        STAT_LAST_SENT_HP_PCT,
        STAT_SOURCE_UNIT_TYPE,
        STAT_SOURCE_UNIT_ID,
        STAT_SHORTPARAM1,
        STAT_QUESTITEMDIFFICULTY,
        STAT_PASSIVE_MAG_MASTERY,
        STAT_PASSIVE_MAG_PIERCE,
    };
    
    public enum D2ItemLocation : uint
    {
        STASH = 0,
        EQUIPPED = 1,
        BELT = 2,
        GROUND = 3,
        CURSOR = 4,
        SOCKET = 6
    };

    public enum D2ItemLocationPanel : byte
    {
        MERCHANT = 1,
        INVENTORY = 0,
        CUBE = 3,
        STASH = 4,
        NONE = 255
    };

    public enum D2ItemEquipLocation : byte
    {
        NOT_EQUIPPED = 0,
        HEAD = 1,
        NECK = 2,
        TORSO = 3,
        HAND_RIGHT = 4,
        HAND_LEFT = 5,
        FINGER_RIGHT = 6,
        FINGER_LEFT = 7,
        WAIST = 8,
        FEET = 9,
        HANDS = 10,
        ALT_HAND_RIGHT = 11,
        ALT_HAND_LEFT = 12,
    };

    public enum D2ItemType : uint
    {
        ARMOR = 1,
        SHIELD = 2,
        WEAPON = 3,
        OTHER = 4
    }
    
    public enum D2ItemIdentified : byte
    {
        NON_IDENTIFIED = 0,
        IDENTIFIED = 1,
    }

    public enum D2ItemRarity : byte
    {
        NONE = 0,
        LOW_QUALITY = 1,
        NORMAL = 2,
        HIGH_QUALITY = 3,
        MAGIC = 4,
        SET = 5,
        RARE = 6,
        UNIQUE = 7,
        CRAFTED = 8,
        TEMPERED, // Was never actually enabled in an official release
    }
    
    [StructLayout(LayoutKind.Explicit)]
    public readonly struct D2StatValueData
    {
        [FieldOffset(0x0)] public readonly ushort Layer;
        [FieldOffset(0x2)] public readonly D2Stat Stat;
        [FieldOffset(0x4)] public readonly int Value;
    }

    [StructLayout(LayoutKind.Explicit)]
    public readonly struct D2StatArrayData
    {
        [FieldOffset(0x0)] public readonly IntPtr FirstStatPtr;
        [FieldOffset(0x8)] public readonly ulong Size;
        [FieldOffset(0x10)] public readonly ulong Capacity;
    }

    [StructLayout(LayoutKind.Explicit)]
    public readonly struct D2StatListData
    {
        [FieldOffset(0x8)] public readonly uint OwnerType;
        [FieldOffset(0xC)] public readonly uint OwnerId;
        [FieldOffset(0x1C)] public readonly uint Flags;
        [FieldOffset(0x80)] public readonly D2StatArrayData Stats;
    }

    [StructLayout(LayoutKind.Explicit)]
    public struct D2ItemData
    {
        [FieldOffset(0x00)] public D2UnitType ObjectType;
        [FieldOffset(0x0C)] public D2ItemLocation Location; // GROUND
    }

    [StructLayout(LayoutKind.Explicit)]
    public struct D2ItemUnitData // pUnitData + n
    {
        [FieldOffset(0x00)] public D2ItemRarity Rarity;
        [FieldOffset(0x18)] private byte _itemIdentified;
        [FieldOffset(0x19)] private byte _itemFlags1; // socketed
        [FieldOffset(0x1A)] private byte _itemFlags2; // etheral
        [FieldOffset(0x50)] public D2ItemEquipLocation EquipLocation;
        [FieldOffset(0x51)] public D2ItemLocationPanel StoreLocation;

        public D2ItemIdentified Identified => (D2ItemIdentified)(_itemIdentified >> 4);
        public bool Etheral => (_itemFlags2 & (1 << 6)) != 0;
        public bool Socketed => (_itemFlags1 & (1 << 3)) != 0;
        public bool New => (_itemFlags1 & (1 << 5)) != 0;

        public bool IsIdentified => Identified == D2ItemIdentified.IDENTIFIED;
    }

    [StructLayout(LayoutKind.Explicit)]
    public struct D2ItemInventoryData // pInventory + n
    {
        [FieldOffset(0x4C)] private byte _socketsFilled;

        public int SocketsFilled => _socketsFilled;
    }
    
    public class BaseD2
    {
        public Pointers Pointers;

        public D2UnitAnyType Unit;

        public override string ToString()
        {
            StringBuilder stringBuilder = new StringBuilder();

            stringBuilder.AppendLine(Pointers.ToString());
            stringBuilder.AppendLine("UID: " + Unit.UID);
            stringBuilder.AppendLine("TXTID: " + Unit.TXTID);
            stringBuilder.AppendLine(Unit.Position.ToString());

            return stringBuilder.ToString();
        }
    }

    public class ItemD2 : BaseD2
    {
        public static Dictionary<D2ItemRarity, Color> ItemRarityColors = new Dictionary<D2ItemRarity, Color>()
        {
            { D2ItemRarity.NORMAL, new Color(240, 240, 240) },
            { D2ItemRarity.HIGH_QUALITY, new Color(240, 240, 240) },
            { D2ItemRarity.LOW_QUALITY, new Color(99, 99, 99) },
